Data/Final_Implemented_data/Request/Request least/TEXT/test_least1.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        714 bytes

Concurrency Level:      10
Time taken for tests:   2.126 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      86962 bytes
HTML transferred:       71462 bytes
Requests per second:    47.05 [#/sec] (mean)
Time per request:       212.550 [ms] (mean)
Time per request:       21.255 [ms] (mean, across all concurrent requests)
Transfer rate:          39.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       37  164  45.0    172     240
Processing:     1   32  46.9      2     156
Waiting:        1   29  42.7      2     147
Total:         48  196  63.1    189     327

Percentage of the requests served within a certain time (ms)
  50%    189
  66%    217
  75%    236
  80%    245
  90%    293
  95%    312
  98%    325
  99%    327
 100%    327 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        958 bytes

Concurrency Level:      10
Time taken for tests:   4.035 seconds
Complete requests:      200
Failed requests:        36
   (Connect: 0, Receive: 0, Length: 36, Exceptions: 0)
Total transferred:      226470 bytes
HTML transferred:       195434 bytes
Requests per second:    49.57 [#/sec] (mean)
Time per request:       201.736 [ms] (mean)
Time per request:       20.174 [ms] (mean, across all concurrent requests)
Transfer rate:          54.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       35  164  41.8    170     251
Processing:     1   34  47.6      4     184
Waiting:        1   31  43.8      3     184
Total:         46  198  64.0    185     372

Percentage of the requests served within a certain time (ms)
  50%    185
  66%    214
  75%    238
  80%    260
  90%    291
  95%    318
  98%    343
  99%    358
 100%    372 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        1202 bytes

Concurrency Level:      10
Time taken for tests:   7.038 seconds
Complete requests:      300
Failed requests:        46
   (Connect: 0, Receive: 0, Length: 46, Exceptions: 0)
Total transferred:      410252 bytes
HTML transferred:       363452 bytes
Requests per second:    42.62 [#/sec] (mean)
Time per request:       234.616 [ms] (mean)
Time per request:       23.462 [ms] (mean, across all concurrent requests)
Transfer rate:          56.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       68  168  46.6    164     317
Processing:     1   60  55.4     64     178
Waiting:        1   54  51.0     57     177
Total:         87  228  74.6    220     411

Percentage of the requests served within a certain time (ms)
  50%    220
  66%    271
  75%    285
  80%    304
  90%    330
  95%    353
  98%    368
  99%    383
 100%    411 (longest request)